{
    "about": "The School of Architecture at the University of Waterloo is a nationally and internationally respected design school. It attracts top students and is dedicated to educating the best architects in the world.\nWorking with colleagues in related professions, our professors and students have made Waterloo Architecture a dynamic centre of research and teaching in construction, development, built heritage, \"green\" architecture, visualization, prototyping, and computer assisted design.", 
    "applicationProcess": null, 
    "avgAdm": "90-93", 
    "contacts": [], 
    "dateEstablished": "01-07-1957", 
    "degree": "Bachelor's of Applied Science", 
    "degreeAbbrev": "BASc", 
    "degreeRequirements": {
        "about": "Architects are largely responsible for the quality and beauty of our constructed environment. Recognized as one of the best in North America, our School of Architecture provides you with a creative, international education and 2 years of paid co-op work experience with design firms in Canada and abroad. You’ll enjoy a small community with a vibrant intellectual atmosphere. Our cultural history courses, which examine the close relationship between architecture and society, and our environmental courses add depth to core courses in design. You’ll spend the fall of fourth year at our studio in Rome, one of the world’s great cities for culture and architecture.", 
        "curriculum": [
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "100", 
                    "description": "An introduction which explores in broad terms the nature of architecture and how it has evolved. The main streams in the development of Western architecture are traced up to the present and lead to a discussion of current work, ideas and concerns.", 
                    "subject": "ARCH", 
                    "title": "An Introduction to Architecture", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "192", 
                    "description": "Development of the means to appreciate the art and science of building; introduction to the study of theories of architecture; development of skills in graphic communication; introduction to a study of building elements; promotion of the application of theory in the practice of design.", 
                    "subject": "ARCH", 
                    "title": "Design Studio", 
                    "units": 1.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "172", 
                    "description": "A focus on the construction of small scale buildings will introduce the fundamentals of building construction demonstrating relationships between design development and: building techniques, materials, building science and construction practices, factors of environment, climate and geology. Case studies and projects for small-scale buildings to investigate: climate, solar geometry, soils, foundations, wood frame, stone and masonry construction. The detailed technical design of a small building as the major term project will be undertaken.", 
                    "subject": "ARCH", 
                    "title": "Building Construction 1", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "142", 
                    "description": "Selected schemes of order, such as fate, providence, natural law, the human will, as expressed in plays, poems and fiction from various ages; selected conventions in literature, cinema, and the visual arts; the development of one or two archetypal symbols in literature and the visual arts; directed to lead into more detailed studies of symbolic patterns in Iconography 2. [Offered: F]", 
                    "subject": "ARCH", 
                    "title": "Cultural History 1: Iconography", 
                    "units": 1
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "143", 
                    "description": "A study centred on ancient life to initiate the student into the stream of cultural history and the complex problems of what the artist is, the quality of human existence, culture, and environment, as well as the working of the icon from a raw state of perceived image to its function as an expressive symbol in poetry, music, dance, architecture and other works of art; a study of modern work in comparison to ancient achievement. [Offered: W]", 
                    "subject": "ARCH", 
                    "title": "Cultural History 2: The Ancient World", 
                    "units": 1
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "125", 
                    "description": "An introduction to the environmental aspects of architectural design and to an analysis of the form that landscapes take and the processes and ideals leading to those forms. Topics of discussion include environmental concepts and influences on design, site planning, landscape, sustainability, embodied energy, climatic influences and microclimates.", 
                    "subject": "ARCH", 
                    "title": "Principles of Environmental Design", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "173", 
                    "description": "An emphasis on the construction of medium to large scale building will examine relationships between design development and the building science and construction practices of structural systems and enclosures. Case studies and projects will be used to investigate: reinforced, precast and prestressed concrete construction; steel framing systems; building envelopes (curtain wall, window walls, glazing and roofing systems); fire protection; interior finish selection. The detailed technical design of a small building as the major term project will be undertaken.", 
                    "subject": "ARCH", 
                    "title": "Building Construction 2", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "193", 
                    "description": "Further development of basic skills, and the application of theory and design in small scale architectural design projects. Introduction to issues of inhabitation, program and context. [Offered: W]", 
                    "subject": "ARCH", 
                    "title": "Design Studio", 
                    "units": 1.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "113", 
                    "description": "Introduction to computing techniques in architecture. Students will engage in the use of the desktop computer in architectural practice. They will be instructed in the conceptual foundations for computer use in architecture, graphic applications for the computer and basic skills for two-dimensional drawing and three-dimensional modelling. [Offered: W]", 
                    "subject": "ARCH", 
                    "title": "Visual Communication 2", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "246", 
                    "description": "Recognition of patterns of life and concepts of order and conduct, models of the universe and other, moving metaphors and myths by means of study of the thoughts, acts, art, architecture, technology, literature, music and town design of the West from the break-up of the Roman Empire until the Renaissance. [Offered: F]", 
                    "subject": "ARCH", 
                    "title": "Cultural History 3: Foundations of Europe", 
                    "units": 1
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "226", 
                    "description": "This study of building construction and design examines relationships between design development and environmental building practices. Case studies, testing exercises, and projects will be used to investigate: solar geometry, influences of climate, regional circumstances, sustainability, vernacular building practice, daylighting, and passive design. Energy related issues will be addressed and energy based software design programs will be introduced. The detailed design of an energy efficient/passive solar building as the final term project will be undertaken.", 
                    "subject": "ARCH", 
                    "title": "Environmental Building Design", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "260", 
                    "description": "Fundamental concepts of mechanics and structures, as related to architectural design, study of loading conditions, forces, moments, systems of forces, conditions of equilibrium for two and three dimensional structures, centre of gravity of loads and areas, bar forces in trusses, simple frame analysis, moment of inertia. Concepts of simple stress and strain; shear and bending moments in simple beams; shear and moment diagrams, qualitative deflected shapes, flexural and shearing stresses, deflection calculations; compression members; Euler's formula. [Offered: F]", 
                    "subject": "ARCH", 
                    "title": "Principles of Structures", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "292", 
                    "description": "The exploration of design as a thinking process through the medium of small scale design projects. The development and analysis of architectural propositions concerning personal space within the context of a larger community.", 
                    "subject": "ARCH", 
                    "title": "Design Studio", 
                    "units": 1.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "272", 
                    "description": "A detailed study of the interior environments of buildings focusing on acoustics, artificial source lighting and day lighting. The course also addresses building services such as electrical distribution, vertical transportation and exterior site services. [Offered: F]", 
                    "subject": "ARCH", 
                    "title": "Interior Environments: Acoustics and Lighting", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "247", 
                    "description": "Analysis of the various styles emerging out of provincial and international Gothic, especially Italian use of classical models, the spread of this Renaissance mode, leading to consideration of the Mannerist, the Baroque, the Rococo, the Neoclassical; investigation of the course of attitudes from humanism, nationalism, and Reformation through the Enlightenment until the French Revolution and Hume's dethronement of Reason. [Offered: S]", 
                    "subject": "ARCH", 
                    "title": "Cultural History 4: Renaissance to Revolution", 
                    "units": 1
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "273", 
                    "description": "A focus on the air and water systems of buildings with an aim to developing knowledge and skills appropriate to architectural practice. Subjects covered include environmental parameters, heating and cooling loads, energy conservative design, the selection of heating, ventilating and air conditioning systems, plumbing systems, and fire protection criteria and systems, with reference to building codes and standards. [Offered: S]", 
                    "subject": "ARCH", 
                    "title": "Environmental Systems", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "276", 
                    "description": "Architectural case studies are used to examine conceptual development, structural design, building process and the selection of structural timber systems. Topics such as flexural, compression and truss members, connections, and plywood construction are studied using calculations, design aids, rules of thumb and the latest CSA design standards. [Offered: S]", 
                    "subject": "ARCH", 
                    "title": "Timber: Design, Structure and Construction", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "293", 
                    "description": "Design involving problems of human perception and dimension in more complex environments, and dealing with issues of public and private space. Development of skills in analysis and programming, and further exploration of questions of siting and context.", 
                    "subject": "ARCH", 
                    "title": "Design Studio", 
                    "units": 1.5
                }, 
                {
                    "catalog_number": "", 
                    "subject": "Elective"
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "343", 
                    "description": "Depiction of modern culture as one in which the notion of environmental order as the fulfilling of natural law is replaced by a notion of order as the historical creation of autonomous wills. Selected works in philosophy, literature, art and architecture will be studied. [Offered: W]", 
                    "subject": "ARCH", 
                    "title": "Enlightenment, Romanticism and the 19th Century", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "364", 
                    "description": "The physio-technical factors that influence building design for performance: durability, efficiency, health and sustainability will be explored. Common building design construction problems, their causes and solutions, will be examined with the aid of case studies. Using the principles of building science, good details of masonry, wood, steel and glass will be developed. [Offered: W]", 
                    "subject": "ARCH", 
                    "title": "Building Science", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "362", 
                    "description": "Architectural case studies are used to examine conceptual development, structural design, building process and the selection of structural steel and concrete systems. Topics such as tension, flexural and compression members; and connections are studied using calculations, design aids, rules of thumb and the latest CSA design standards. [Offered: W]", 
                    "subject": "ARCH", 
                    "title": "Steel and Concrete: Design, Structure and Construction", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "392", 
                    "description": "Development of design skills and theoretical knowledge through their application in projects involving various building types in urban situations. Emphasis is placed upon issues of materiality and technology in architectural design.", 
                    "subject": "ARCH", 
                    "title": "Design Studio", 
                    "units": 1.5
                }, 
                {
                    "catalog_number": "", 
                    "subject": "Elective"
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "342", 
                    "description": "An overview of the individuals and movements associated with the birth of modern architecture in the nineteenth and early twentieth century. The social, technological and aesthetic ambitions of the modern project are critically reviewed and its development and dissemination in Europe, the Americas and Asia is traced. Selected works are examined in depth as examples of the canonic and variant forms of modernism. [Offered: F]", 
                    "subject": "ARCH", 
                    "title": "Modern Architecture", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "327", 
                    "description": "An introduction to the structure and form of urban environments as understood through the urban architecture. The forces that determine the creation and development of urban places will be examined. Topics include: the plan as a generative form, urban building types, urban morphology and the shape of the public realm, infrastructure as both system and architectural object, nature and the park, and real estate and development controls. Of special interest will be analyses of the suburb and urban master plans. [Offered: F]", 
                    "subject": "ARCH", 
                    "title": "Architecture of the Urban Environment", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "365", 
                    "description": "This course builds on the principles learned in the previous structural design courses to the field of application. Students will design, construct, and test full size prototypes of chairs and other structures of limited scale. Performance will be predicted and analyzed in the wake of testing. A full structural report is required. [Offered: F]", 
                    "subject": "ARCH", 
                    "title": "Structural Design Build Workshop", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "393", 
                    "description": "This Design Studio is subdivided into 3 or 4 sections, as a function of enrolment, each given to detailed exploration of an architectural project with varying themes. [Offered: F]", 
                    "subject": "ARCH", 
                    "title": "Design Studio", 
                    "units": 1.5
                }, 
                {
                    "catalog_number": "", 
                    "subject": "Elective"
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "446", 
                    "description": "The course provides a survey of the history of settlement and urban form on the Italian peninsula from antiquity to the present day. In it the influences upon the structure of public and private space are outlined for each historical period. These include constants such as geography and climate, but more especially the factors that induce and manifest change: politics, warfare, economics, social structure, the arts and theory.", 
                    "subject": "ARCH", 
                    "title": "Italian Urban History (Rome)", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "448", 
                    "description": "History of settlement and building in Rome and the surrounding area from antiquity to the present. Acts of design in architecture, urban form and landscape related to political, cultural and spiritual authority of Rome. Comparison drawn between the image of the city, represented in literature and art, and the material facts of the place. Field trips, lecture.", 
                    "subject": "ARCH", 
                    "title": "Rome and the Campagna (Rome)", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "492", 
                    "description": "The studio course is mounted in Rome, Italy, with the school's own faculty and premises, and offers a unique opportunity to undertake design studies in a truly rich architectural heritage. The main focus is the nature of the institution and its relationship to the city and its culture. Students participating in the Rome term are expected to defray the costs of travel, accommodation and food. For students unable to study in Rome, an alternative studio is offered in Cambridge. It presents similar design projects and theoretical questions in a North American context. [Offered: F]", 
                    "subject": "ARCH", 
                    "title": "Design Studio", 
                    "units": 1.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "449", 
                    "description": "The course addresses the issues of architecture and urbanism in Rome and Italy from 1750 to the present. It explores the relationship between cultural, political and artistic phenomena such as Futurism, Novecento and Rationalism, that anticipate and create modernism in Italy. [Two one day field trips, estimated cost $60.00. Offered: F]", 
                    "subject": "ARCH", 
                    "title": "The Development of Modern Italian Architecture (Rome)", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "442", 
                    "description": "A forum for the discussion of selected topics in twentieth century culture. Through detailed examination of both creative works and critical texts from the fields of visual art, film, literature, philosophy, and history, students will explore the ideas and the images of modernity. [Offered: S]", 
                    "subject": "ARCH", 
                    "title": "Modernisms: Twentieth Century Culture and Criticism", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "425", 
                    "description": "This course provides an historical overview of the ideas of nature and landscape in Western thought. 'Nature', 'Ecology', and 'Landscape' are treated as cultural constructs, related to specific philosophical, technological, economic, political, and social issues. Many of these issues will be considered as the course of study traces the continuity, rather than the progression, of landscape ideas. [Offered: S]", 
                    "subject": "ARCH", 
                    "title": "Theory and Design of the Contemporary Landscape", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "473", 
                    "description": "Students will investigate and report on technical issues as they relate to the development of the comprehensive building project in the parallel Design Studio. Innovation and integration in architectural design will be stressed with respect to structure, building envelope, environmental systems, health and life safety, movement systems, site planning and the integration of information technology. [Offered: S]", 
                    "subject": "ARCH", 
                    "title": "Technical Report", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "493", 
                    "description": "This studio represents a culmination of the pre-professional degree, through the integration and application of skills and knowledge to a complex building project. Students will develop designs to a high level of detail. A concern for technical material, environmental and legal aspects of architecture will support open speculation and innovative design. [Offered: S]", 
                    "subject": "ARCH", 
                    "title": "Design Studio/Comprehensive Building Design", 
                    "units": 1.5
                }
            ]
        ], 
        "curriculumTerms": [
            "1A", 
            "1B", 
            "2A", 
            "2B", 
            "3A", 
            "3B", 
            "4A", 
            "4B"
        ]
    }, 
    "facultyId": "", 
    "fees": {
        "domestic": [
            {
                "term": "1A", 
                "tuition": 4179,
                "totalFees": 4716.95
            }, 
            {
                "term": "1B", 
                "tuition": 4179,
                "totalFees": 4716.95
            }, 
            {
                "term": "2A", 
                "tuition": 4179,
                "totalFees": 5350.95
            }, 
            {
                "term": "2B", 
                "tuition": 4099,
                "totalFees": 5270.95
            }, 
            {
                "term": "3A", 
                "tuition": 4004,
                "totalFees": 5175.95
            }, 
            {
                "term": "3B", 
                "tuition": 4004,
                "totalFees": 5175.95
            }, 
            {
                "term": "4A", 
                "tuition": 3909,
                "totalFees": 5080.95
            }, 
            {
                "term": "4B", 
                "tuition": 3764,
                "totalFees": 4935.95
            }
        ], 
        "international": [
            {
                "term": "1A", 
                "tuition": 15462,
                "totalFees": 17065.95
            }, 
            {
                "term": "1B", 
                "tuition": 15462,
                "totalFees": 17065.95
            }, 
            {
                "term": "2A", 
                "tuition": 15462,
                "totalFees": 17065.95
            }, 
            {
                "term": "2B", 
                "tuition": 15462,
                "totalFees": 17065.95
            }, 
            {
                "term": "3A", 
                "tuition": 15462,
                "totalFees": 17065.95
            }, 
            {
                "term": "3B", 
                "tuition": 15462,
                "totalFees": 17065.95
            }, 
            {
                "term": "4A", 
                "tuition": 15462,
                "totalFees": 17065.95
            }, 
            {
                "term": "4B", 
                "tuition": 15462,
                "totalFees": 17065.95
            }
        ]
    },
    "gradPopulation": "100", 
    "images": [
        {
            "descriptor": "e5 building", 
            "link": "http://sub.tsavers.com/wp-content/uploads/2014/04/University-of-Waterloo-3.jpg", 
            "type": "misc"
        }
    ], 
    "importantDates": null, 
    "internship": null, 
    "location": null, 
    "metaData": {
        "dateCreated": "01-09-2014", 
        "dateModified": "01-09-2014", 
        "yearValid": 2015
    }, 
    "name": "Architecture", 
    "numAccepted": "", 
    "numApplicants": "", 
    "rankings": [], 
    "rating": {
        "classmates": 0, 
        "difficulty": 0, 
        "guyRatio": 92.5, 
        "professors": 0, 
        "ratingOverall": 0, 
        "schedule": 0, 
        "socialEnjoyment": 0, 
        "studyEnv": 0
    }, 
    "relatedProgramKeys": [], 
    "requirements": {
        "ap": "The Faculty of Engineering considers AP courses to be a good challenge and good preparation for our programs. You may find that you have covered some of the material in our first term courses but, in most cases, not enough for you to be exempted from the entire course without potentially running into academic difficulties later. The depth and level of problem-solving is very different in our Engineering programs than in AP courses and as a result, we don't grant first-year course exemptions for AP courses.", 
        "average": "<a href=\"https://uwaterloo.ca/find-out-more/admissions/individual-selection\">Individual selection</a> from the low 90s", 
        "country": "", 
        "general_requirements": "<ul><li>High school diploma or equivalent.<li>For some programs, a minimum grade in a required course is specified.</li><li>A minimum <b>final</b> overall average of 80% or higher is required on your best 6 Grade 12 U and/or M courses, including required courses.</li><ul><li>Higher averages are required for admission to programs where demand exceeds the number of places available.</li></ul><li>Grade 12 U or M courses must be completed through a school that is inspected by the Ontario Ministry of Education.</li><li><a href=\"https://uwaterloo.ca/find-out-more/admissions/repeated-courses\">Repeated courses</a> may be taken into consideration depending on the program.</li></ul>", 
        "individual_courses": [
            {
                "course_code": "4U", 
                "course_title": "Calculus and Vectors", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "English", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Physics", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Chemistry", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Advanced Functions", 
                "min_grade": "70"
            }
        ], 
        "international_program_requirements": "", 
        "list_courses": "", 
        "notes": "", 
        "other_documentation": [
            "If your first language is not English, you may need to meet our <a href=\" https://uwaterloo.ca/find-out-more/elr\">English language requirements.</a>", 
            "An <a href='https://uwaterloo.ca/find-out-more/aif'>Admission Information Form</a> must be filled out for most programs. Instructions will be included with the acknowledgment of your application.", 
            "<ul><li>Learn more about <a href=\" https://uwaterloo.ca/find-out-more/programs/mechatronics-engineering \">Mechatronics Engineering</a></li><li><a href=\"https://uwaterloo.ca/find-out-more/request\">Request a Faculty of Engineering brochure</a></li><li>Join us for a <a href=\"https://uwaterloo.ca/find-out-more/visit-waterloo/events \">campus tour</a></li></ul>"
        ], 
        "program": "Architecture", 
        "program_notes": "", 
        "province": "Ontario", 
        "recommended_courses": "", 
        "system_of_study": "", 
        "transfer_credits": ""
    }, 
    "schoolId": "", 
    "shortName": "arch", 
    "slug": "architecture", 
    "streams": null, 
    "undergradPopulation": "356"
}