{
    "about": "Chemical Engineers apply scientific and engineering principles to develop processes or systems for the economic production and distribution of useful and value-added materials through the physical, chemical or biochemical transformation of matter. Furthermore, this must be accomplished with attention paid to economics, health and safety, and environmental impact.\nChemical Engineers combine a sound background in fundamental understanding of science and mathematics with highly-developed problem-solving skills to improve existing processes or methods, or to implement new ones. Chemical Engineers are distinguished from physical scientists such as chemists by their training in the engineering method the use of heuristics to cause the best change in a poorly understood situation within the available resources.\nChemical Engineers design, analyse, optimize and control processing operations, or guide others who perform these functions, in industry, government, universities or private practice. Most materials encountered in daily life have been impacted by Chemical Engineering at some stage. Chemical Engineers will continue to be in demand for many exciting new developments over the next few decades.", 
    "applicationProcess": null, 
    "avgAdm": "90-93", 
    "contacts": [], 
    "dateEstablished": "01-07-1957", 
    "degree": "Bachelor's of Applied Science", 
    "degreeAbbrev": "BASc", 
    "degreeRequirements": {
        "about": "The curriculum offers courses in life science and material science, to provide the fundamentals required for future careers in the biotechnology or nanotechnology areas. There are four technical elective courses that can be taken to either focus in an area of particular interest or to build a strong general background for maximum career flexibility.\nThe main emphasis in the first and second year is on courses in science and mathematics which provide the foundations upon which engineering skills can be built. The upper-year core and elective courses assume and require this background.\nTo perform successfully, the Chemical Engineer must be able to design, analyse and control processes to produce useful and desirable products from less valuable raw materials in an efficient, economic and socially responsible way. The knowledge and skills essential for achieving these goals are developed in the core Chemical Engineering courses taken mainly in the third and fourth years (e.g., in fluid mechanics, heat and mass transfer, thermodynamics, reactor design, biotechnology, process control, process and equipment design). Most of these courses are a mixture of theory and practice. Computer simulations and hands-on laboratory experiences are used in several courses to reinforce the theoretical principles.", 
        "curriculum": [
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "100", 
                    "description": "Introduction to basic methods and principles in Chemical Engineering. The fundamentals of engineering calculations (units and dimensions), behaviour of fluids, mass balances, processes and process variables. Laboratory on visual communication: engineering graphics, computer software including spread sheets, computer aided design. Technical communication: word processing software, elements of technical report writing. Aspects of the engineering profession including ethics, safety, and intellectual property. Professional development including résumé skills, interview skills, and preparation for co-op terms.", 
                    "subject": "CHE", 
                    "title": "Chemical Engineering Concepts 1", 
                    "units": 0.75
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "102", 
                    "description": "Chemical principles with applications in engineering. Stoichiometric calculations, properties of gases, properties of liquids and solutions, gas phase chemical equilibrium, ionic equilibrium in aqueous solution, oxidation-reduction reactions, chemical kinetics. [Offered: F]", 
                    "subject": "CHE", 
                    "title": "Chemistry for Engineers", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "115", 
                    "description": "Linear equations, matrices and determinants. Introduction to vector spaces. Eigenvalues and diagonalization. Applications. Complex numbers. [Offered: F]", 
                    "subject": "MATH", 
                    "title": "Linear Algebra for Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "116", 
                    "description": "Functions: review of polynomials, exponential, logarithmic, trigonometric. Operations on functions, curve sketching. Trigonometric identities, inverse functions. Derivatives, rules of differentiation. Mean Value Theorem, Newton's Method. Indeterminate forms and L'Hopital's rule, applications. Integrals, approximations, Riemann definite integral, Fundamental Theorems. Applications of the integral. [Offered: F]", 
                    "subject": "MATH", 
                    "title": "Calculus 1 for Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "115", 
                    "description": "Brief review of kinematics. Particle dynamics, work, energy, conservation of energy. Conservation of linear momentum, collisions, rotational kinematics and dynamics, conservation of angular momentum. Equilibrium of rigid bodies. [Offered: F]", 
                    "subject": "PHYS", 
                    "title": "Mechanics", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "101", 
                    "description": "An extension of the topics covered in CHE 100. Energy balances. Laboratory experiments illustrate the physical principles discussed. (In the Winter term only: professional development including résumé skills, interview skills, and preparation for co-op terms.) [Offered: W, S]", 
                    "subject": "CHE", 
                    "title": "Chemical Engineering Concepts 2", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "121", 
                    "description": "Introduction to digital computers, hardware and software organization. Programming fundamentals. Algorithms and control structures. Computer communication. Spreadsheets for problem solving, plotting, fitting data, building new functions, and making iterations and loops. Problem solution, plotting, and creating complex programs in a programming environment. Elementary numerical methods (e.g. Taylor series summations, roots of equations, roots of polynomials, system of linear and nonlinear algebraic equations, integration). Applications in Chemical Engineering. [Offered: W, S]", 
                    "subject": "CHE", 
                    "title": "Engineering Computation", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "161", 
                    "description": "Introduction to basic concepts of biochemistry and cell biology. Overview of the chemistry of amino acids, carbohydrates, lipids and nucleic acids. Properties and functions of biopolymers. Elements of cell structure and diversity, and relationship of biochemistry with cell metabolism. A focus on biotechnologically relevant examples such as biomimetic engineering design, proteomics, system biology and high throughput biology. [Offered: W, S]", 
                    "subject": "CHE", 
                    "title": "Engineering Biology", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "123", 
                    "description": "Analysis of linear circuits: Voltage, current, resistance, capacitance, inductance, voltage source, current source, dependent sources, Ohm's Law, Kirchoff's Law, nodal analysis, mesh analysis, Thevinin/Norton equivalents, operational amplifier circuits, time response, sinusoidal steady-state response. Introduction to diodes with applications.", 
                    "subject": "GENE", 
                    "title": "Electrical Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "118", 
                    "description": "Methods of integration: by parts, trigonometric substitutions, partial fractions; engineering applications, approximation of integrals, improper integrals. Linear and separable first order differential equations, applications. Parametric curves and polar coordinates, arc length and area. Infinite sequences and series, convergence tests, power series and applications. Taylor polynomials and series, Taylor's Remainder Theorem, applications. [Offered: W,S]", 
                    "subject": "MATH", 
                    "title": "Calculus 2 for Engineering", 
                    "units": 0.5
                }, 
                {
                    "catalog_number": "1", 
                    "subject": "CSE"
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "200", 
                    "description": "Equilibrium between phases; the equilibrium stage concept. Cascades of stages with and without reflux; group methods and stage-by-stage approaches; graphical solutions. Applications in the separation of components by distillation, absorption, stripping, extraction and leaching. [Offered: F, W]", 
                    "subject": "CHE", 
                    "title": "Equilibrium Stage Operations", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "220", 
                    "description": "Introduction to statistical methods for analyzing and interpreting process data. Introduction to statistical ideas, probability theory, distribution theory, sampling theory, confidence intervals and significance tests. Introduction to regression analysis. Introduction to design of experiments and statistical quality control. [Offered: F, W]", 
                    "subject": "CHE", 
                    "title": "Process Data Analysis", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "230", 
                    "description": "Thermodynamics: work and heat as forms of energy. First law, internal energy and enthalpy. Heats of chemical and physical changes. Cycles and the second law, entropy. Spontaneity and equilibrium, free energies. Systems of variable composition, chemical equilibrium. Phase equilibrium and the phase rule. Ideal solutions, colligative properties. [Offered: F, W]", 
                    "subject": "CHE", 
                    "title": "Physical Chemistry 1", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "290", 
                    "description": "A selection of computer and laboratory exercises refreshing and reinforcing material covered in the previous term. Topics may include: basic microbiology and biotechnology, introductory physical chemistry, mass and energy balances. [Offered: F, W]", 
                    "subject": "CHE", 
                    "title": "Chemical Engineering Lab 1", 
                    "units": 0.25
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "262", 
                    "description": "Bonding, structure and nomenclature in organic chemistry. Physical properties and simple reactions associated with the important functional groups. [Offered: F,W; previously numbered CHEM 28]", 
                    "subject": "CHEM", 
                    "title": "Organic Chemistry for Engineering and Bioinformatics Students", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "262L", 
                    "description": "Selected experiments for engineering students taking CHEM 262. [Offered: F,W; previously numbered CHEM 28L]", 
                    "subject": "CHEM", 
                    "title": "Organic Chemistry Laboratory for Engineering Students", 
                    "units": 0.25
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "217", 
                    "description": "Curves and surfaces in R3. Multivariable functions, partial derivatives, the chain rule, gradients. Optimization, Lagrange Multipliers. Double and triple integrals, change of variable. Vector fields, divergence and curl. Vector integral calculus: Green's theorem, the Divergence theorem and Stokes' theorem. Applications in engineering are emphasized. [Offered: F,W]", 
                    "subject": "MATH", 
                    "title": "Calculus 3 for Chemical Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "298", 
                    "description": "Directed research project under the supervision of faculty members. Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers. Taken over and above normal course load. Good standing and permission of department required for registration.", 
                    "subject": "CHE", 
                    "title": "Directed Research Project", 
                    "units": 0.25
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "211", 
                    "description": "Fundamentals of fluid flow. Conservation laws for mass, momentum and mechanical energy. Flow of fluids in conduits. Flow past immersed bodies. Flow through beds of solids, fluidization. Transportation and metering of fluids. Dimensional analysis. [Offered: F, S]", 
                    "subject": "CHE", 
                    "title": "Fluid Mechanics", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "231", 
                    "description": "Thermodynamics: ideal solutions; non-ideal solutions, non-electrolytic and electrolytic solutions, phase equilibrium and phase diagrams, reaction equilibrium. Surface phenomena: surface tension, capillarity, properties of small particles, adsorption. Chemical kinetics: rate laws, reaction rates, mechanisms, catalysis, heterogeneous reactions. [Offered: F, S]", 
                    "subject": "CHE", 
                    "title": "Physical Chemistry 2", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "241", 
                    "description": "Fundamentals; atomic bonding, crystalline structure, crystal defects, non-crystalline materials; structure and properties of metals, ceramics, glasses, semi-conductors. Amorphous materials, polymers, composites. Processing and concepts of engineering design of materials. [Offered: F, S]", 
                    "subject": "CHE", 
                    "title": "Materials Science and Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "291", 
                    "description": "A selection of computer and laboratory exercises refreshing and reinforcing material covered in the previous term. Topics may include: physical chemistry, design of experiments and statistics, and equilibrium stage operations. [Offered: F, S]", 
                    "subject": "CHE", 
                    "title": "Chemical Engineering Lab 2", 
                    "units": 0.25
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "218", 
                    "description": "First order equations, second order linear equations with constant coefficients, series solutions, the Laplace transform method, systems of linear differential equations. Applications in engineering are emphasized. [Offered: F,S]", 
                    "subject": "MATH", 
                    "title": "Differential Equations for Engineers", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "261", 
                    "description": "Introductory Finance: time value of money, cash flow analysis. Investment evaluation methods: present worth, annual worth and internal rate of return. Depreciation models and asset replacement analysis. The impact of inflation, taxation, uncertainty and risk on investment decisions. [Offered: F,W,S]", 
                    "subject": "MSCI", 
                    "title": "Engineering Economics: Financial Management for Engineers", 
                    "units": 0.5
                }, 
                {
                    "catalog_number": "1", 
                    "subject": "WKRPT-4stream"
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "299", 
                    "description": "Directed research project under the supervision of faculty members. Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers. Taken over and above normal course load. Good standing and permission of department required for registration.", 
                    "subject": "CHE", 
                    "title": "Directed Research Project", 
                    "units": 0.25
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "312", 
                    "description": "Fundamentals of mass transfer: species and mixture velocities, diffusive and convective fluxes, Fick's law and the diffusion coefficient. Vector form of the microscopic (differential) mass balance. Fundamentals of heat transfer: conduction, convection and radiation, Fourier's law and thermal conductivity. Vector form of the microscopic thermal energy balance for solids and incompressible fluids. Mass and heat transfer models leading to ordinary differential equation problems in Cartesian, cylindrical and spherical geometries; types of boundary conditions. Bessel functions. Analytical solution of linear partial differential equations: combination of variables, separation of variables and Sturm-Liouville theory, Laplace transform. Mass and heat transfer models leading to linear partial differential equations: 1D transient diffusion and conduction in Cartesian, cylindrical and spherical geometries; steady-state 2D conduction and diffusion. Heat-mass transfer analogies and dimensionless numbers. [Offered: W,S]", 
                    "subject": "CHE", 
                    "title": "Mathematics of Heat and Mass Transfer", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "322", 
                    "description": "Systems of linear and non-linear algebraic equations; polynomial and spline interpolation; numerical differentiation and integration; numerical solution of initial value and boundary value ordinary differential equation problems: accuracy and stability, step size control and stiffness; finite differences for the numerical solution of elliptic and parabolic partial differential equations: method of lines, explicit vs. implicit finite-difference methods; introduction to the finite element method (optional). The course extends material on numerical methods and their implementation in Matlab, covered in CHE 121, to address a variety of models of chemical engineering processes. [Offered: W, S]", 
                    "subject": "CHE", 
                    "title": "Numerical Methods for Process Analysis and Design", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "330", 
                    "description": "Review of fundamentals, including 2nd law and concepts of equilibrium, phase and reaction equilibria, fugacity, exergy. Thermodynamics applied to practical situations. Examples chosen from: fluid flow; power generation; refrigeration; air conditioning and water cooling; liquefaction of gases; equilibria in complex chemical reactions and separation processes; surface phenomena; electrochemical reactions; biological processes. [Offered: W, S]", 
                    "subject": "CHE", 
                    "title": "Chemical Engineering Thermodynamics", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "360", 
                    "description": "Review of elementary aspects of molecular biology, genetic engineering, biochemistry, microbiology. Biological systems for the production of commercial goods and services: foods, pharmaceuticals, chemicals, fuels, equipment, diagnostics, waste treatment, and biomaterials. Properties of microbial, plant and animal cells, and of enzymes used in bioprocess applications. Classification and characterization of biological agents and materials; quantification of metabolism, biokinetics, bioenergetics. Introduction to design of bioprocess systems, including biosafety and good manufacturing practices. [Offered: W, S]", 
                    "subject": "CHE", 
                    "title": "Bioprocess Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "390", 
                    "description": "A selection of computer and laboratory exercises refreshing and reinforcing material covered in the previous term. Topics may include: fluid mechanics, physical chemistry and kinetics, materials properties and testing. [Offered: W, S]", 
                    "subject": "CHE", 
                    "title": "Chemical Engineering Lab 3", 
                    "units": 0.25
                }, 
                {
                    "catalog_number": "2", 
                    "subject": "CSE"
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "2", 
                    "description": "A work-term report presenting in detail a technical project, activity, or analysis engaged by the student during the work term.", 
                    "subject": "WKRPT", 
                    "title": "Work-term Report", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "398", 
                    "description": "Directed research project under the supervision of faculty members. Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers. Taken over and above normal course load. Good standing and permission of department required for registration.", 
                    "subject": "CHE", 
                    "title": "Directed Research Project", 
                    "units": 0.25
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "311", 
                    "description": "Review of stoichiometry and chemical kinetics. Homogeneous reactors: isothermal operation; batch; semi-batch; continuous tank; plug flow reactor design. CSTRs in series; plug flow reactor with recycle. Multiple reactions in reactor networks. Temperature effects in adiabatic and non-isothermal reactors. Yield, selectivity and optimal operation of reactors. Heterogeneous catalysis and effectiveness factors in two-phase reactors. [Offered: F, W]", 
                    "subject": "CHE", 
                    "title": "Chemical Reaction Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "313", 
                    "description": "Convective heat transfer. Analysis of convective heat transfer in external flows using boundary layer approach. Analysis of convective heat transfer in internal flows. Empirical correlations for convective heat transfer. Heat transfer with phase change: condensation and boiling. Heat exchanger design. Convective mass transfer. Empirical correlations for convective mass transfer. Mass transfer at fluid-fluid interfaces. Design of continuous differential contactors for absorption/stripping, distallation and liquid-liquid extraction. Analogy between heat, mass and momentum transfer. Dimensional analysis. Simultaneous heat and mass transfer operations. [Offered: F, W]", 
                    "subject": "CHE", 
                    "title": "Applications of Heat and Mass Transfer", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "325", 
                    "description": "Examines the role of the statistical design of experiments and data analysis in continuous process improvement and product development. The application of screening designs, single and multifactor including two-level factorial designs, response surface designs such as central composite and Box-Behnken, and designs for the study of mixture variables for recipe optimization. Use of statistical analysis software to apply these techniques. [Offered: F, W]", 
                    "subject": "CHE", 
                    "title": "Strategies for Process Improvement and Product Development", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "331", 
                    "description": "Topics and applications of electrochemistry and electrochemical engineering. Industrial process examples. Environmental aspects. Ionic equilibria. Laws of electrolysis. Theory of electrolytes. Transport properties of electrolytes. Reversible cell potentials. Irreversible electrode processes. Thermodynamic and kinetic aspects of corrosion. Common examples of corrosion. Electrochemical energy conversion and storage. [Offered: F, W]", 
                    "subject": "CHE", 
                    "title": "Electrochemical Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "391", 
                    "description": "A selection of computer and laboratory exercises refreshing and reinforcing material covered in the previous term. Topics may include: electrochemistry, heat transfer, mass transfer, fermentation and bioseparations. [Offered: F, W]", 
                    "subject": "CHE", 
                    "title": "Chemical Engineering Lab 4", 
                    "units": 0.25
                }, 
                {
                    "catalog_number": "3/1", 
                    "subject": "CSE/TE"
                }, 
                {
                    "catalog_number": "2", 
                    "subject": "WKRPT-8stream"
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "399", 
                    "description": "Directed research project under the supervision of faculty members. Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers. Taken over and above normal course load. Good standing and permission of department required for registration.", 
                    "subject": "CHE", 
                    "title": "Directed Research Project", 
                    "units": 0.25
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "420", 
                    "description": "Laplace transform techniques. Proportional-integral-derivative control. Frequency response methods. Stability analysis. Controller tuning. Process control simulation and computer control systems. Process identification. [Offered: F, S]", 
                    "subject": "CHE", 
                    "title": "Introduction to Process Control", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "480", 
                    "description": "Development and analysis of process flowsheets and chemical product design. Design and selection of common process equipment such as heat exchangers, pumps, piping, staged separations. Incorporation of pollution prevention and inherently safer design principles. Equipment and project cost estimation. [Offered: F, S]", 
                    "subject": "CHE", 
                    "title": "Process Analysis and Design", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "482", 
                    "description": "In this course, students study the design process including: problem definition and needs analysis; process synthesis, process debottlenecking and troubleshooting; safety and environmental protection in design; written and oral communication for design reports. A significant portion of the term work will be devoted to a group design project, culminating in a design proposal that will be presented to the department. [Offered: F, S]", 
                    "subject": "CHE", 
                    "title": "Chemical Engineering Design Workshop", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "490", 
                    "description": "A selection of computer and laboratory exercises refreshing and reinforcing material covered in the previous term. Topics may include: reaction kinetics and reactor engineering, heat and mass transfer unit operations, numerical methods, principles of design and safety. [Offered: F, S]", 
                    "subject": "CHE", 
                    "title": "Chemical Engineering Lab 5", 
                    "units": 0.25
                }, 
                {
                    "catalog_number": "3/1", 
                    "subject": "CSE/TE"
                }, 
                {
                    "catalog_number": "4", 
                    "subject": "CSE"
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "3", 
                    "description": "A work-term report presenting in detail a technical project, activity, or analysis engaged by the student during the work term.", 
                    "subject": "WKRPT", 
                    "title": "Work-term Report", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "498", 
                    "description": "Directed research project under the supervision of faculty members. Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers. Taken over and above normal course load. Good standing and permission of department required for registration.", 
                    "subject": "CHE", 
                    "title": "Directed Research Project", 
                    "units": 0.25
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "483", 
                    "description": "Student design teams of two to four members work on design projects of industrial scope and importance under the supervision of a faculty member. The projects are a continuation of those initiated in CHE 482. [Offered: W]", 
                    "subject": "CHE", 
                    "title": "Group Design Project", 
                    "units": 0.5
                }, 
                {
                    "catalog_number": "2", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "3", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "4", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "5", 
                    "subject": "CSE"
                }
            ]
        ], 
        "curriculumTerms": [
            "1A", 
            "1B", 
            "2A", 
            "2B", 
            "3A", 
            "3B", 
            "4A", 
            "4B"
        ]
    }, 
    "facultyId": "", 
    "fees": null, 
    "gradPopulation": "229", 
    "images": [
        {
            "descriptor": "e5 building", 
            "link": "http://sub.tsavers.com/wp-content/uploads/2014/04/University-of-Waterloo-3.jpg", 
            "type": "misc"
        }
    ], 
    "importantDates": null, 
    "internship": null, 
    "location": null, 
    "metaData": {
        "dateCreated": "01-09-2014", 
        "dateModified": "01-09-2014", 
        "yearValid": 2015
    }, 
    "name": "Chemical Engineering", 
    "numAccepted": "", 
    "numApplicants": "", 
    "rankings": [], 
    "rating": {
        "classmates": 0, 
        "difficulty": 0, 
        "guyRatio": 65.8, 
        "professors": 0, 
        "ratingOverall": 0, 
        "schedule": 0, 
        "socialEnjoyment": 0, 
        "studyEnv": 0
    }, 
    "relatedProgramKeys": [
        "universityofwaterloo_facultyofengineering_nanotechnologyengineering"
    ], 
    "requirements": {
        "ap": "The Faculty of Engineering considers AP courses to be a good challenge and good preparation for our programs. You may find that you have covered some of the material in our first term courses but, in most cases, not enough for you to be exempted from the entire course without potentially running into academic difficulties later. The depth and level of problem-solving is very different in our Engineering programs than in AP courses and as a result, we don't grant first-year course exemptions for AP courses.", 
        "average": "<a href=\"https://uwaterloo.ca/find-out-more/admissions/individual-selection\">Individual selection</a> from the low 90s", 
        "country": "", 
        "general_requirements": "<ul><li>High school diploma or equivalent.<li>For some programs, a minimum grade in a required course is specified.</li><li>A minimum <b>final</b> overall average of 80% or higher is required on your best 6 Grade 12 U and/or M courses, including required courses.</li><ul><li>Higher averages are required for admission to programs where demand exceeds the number of places available.</li></ul><li>Grade 12 U or M courses must be completed through a school that is inspected by the Ontario Ministry of Education.</li><li><a href=\"https://uwaterloo.ca/find-out-more/admissions/repeated-courses\">Repeated courses</a> may be taken into consideration depending on the program.</li></ul>", 
        "individual_courses": [
            {
                "course_code": "4U", 
                "course_title": "Calculus and Vectors", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "English", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Physics", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Chemistry", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Advanced Functions", 
                "min_grade": "70"
            }
        ], 
        "international_program_requirements": "", 
        "list_courses": "", 
        "notes": "", 
        "other_documentation": [
            "If your first language is not English, you may need to meet our <a href=\" https://uwaterloo.ca/find-out-more/elr\">English language requirements.</a>", 
            "An <a href='https://uwaterloo.ca/find-out-more/aif'>Admission Information Form</a> must be filled out for most programs. Instructions will be included with the acknowledgment of your application.", 
            "<ul><li>Learn more about <a href=\" https://uwaterloo.ca/find-out-more/programs/mechatronics-engineering \">Mechatronics Engineering</a></li><li><a href=\"https://uwaterloo.ca/find-out-more/request\">Request a Faculty of Engineering brochure</a></li><li>Join us for a <a href=\"https://uwaterloo.ca/find-out-more/visit-waterloo/events \">campus tour</a></li></ul>"
        ], 
        "program": "Chemical Engineering", 
        "program_notes": "", 
        "province": "Ontario", 
        "recommended_courses": "", 
        "system_of_study": "", 
        "transfer_credits": ""
    }, 
    "schoolId": "", 
    "shortName": "chem", 
    "slug": "chemicalengineering", 
    "streams": null, 
    "undergradPopulation": "715"
}