{
    "about": "Biomedical engineering lies at the interface of engineering and life sciences. Using engineering and design principles, a biomedical engineer works towards the advancement of biology and medicine, developing innovative technologies and solutions to health-related problems, such as new tools and models to diagnose, monitor, treat and prevent disease.\nThe undergraduate program in Biomedical Engineering, housed in the department of Systems Design Engineering at Waterloo, is a stand-alone engineering program. The program provides an integrated systems approach to the study of biomedical engineering, where basic knowledge and skills such as biology, mechanics, physics, chemistry, system analysis and design are taught in the context of biomedical related applications while taking into consideration the complexity of biomedical systems.", 
    "applicationProcess": null, 
    "avgAdm": "90-93", 
    "contacts": null, 
    "dateEstablished": "01-07-1957", 
    "degree": "Bachelor's of Applied Science", 
    "degreeAbbrev": "BASc", 
    "degreeRequirements": {
        "about": "The Biomedical Engineering curriculum is specifically designed to provide students with a clear understanding of human physiological systems and systems analysis and theory, combined with a thorough knowledge of engineering and design principles. Life sciences and biomedical engineering design are taught right from the start of first year. The first three years of the program are intended to provide each student with a solid engineering background in areas relevant to biomedical issues.\nThroughout these three years the student's ability to grasp real engineering problems is enhanced by courses in systems design methodology followed by a series of challenging problem-solving experiences in the Biomedical Design Workshops. A focus is then given to the whole curriculum and the student learns to apply the lecture material, to develop skills in solving biomedical problems while developing design and project management abilities.\nThe final year of the program is comprised mostly of TEive courses, allowing the student to focus on one or more areas of study. This provides the required background for a future year of advanced study to the MASc degree, or for a rewarding career in industry or government with a Bachelor's degree (BASc).", 
        "curriculum": [
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "101", 
                    "description": "This course introduces first year students to Biomedical Engineering with a focus on the engineering profession and technical communication skills: written, oral, and graphical. Engineering practice will be discussed, including engineering professional development, engineering ethics, résumé writing skills, interview skills, the co-op system, and preparations for the upcoming co-op term. [Offered: F]", 
                    "subject": "BME", 
                    "title": "Introduction to Biomedical Engineering", 
                    "units": 0.25
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "101L", 
                    "description": "This laboratory course will introduce students to engineering graphic design using various computer-aided-design (CAD) software packages. Detail drawings, assembly drawings, dimensioning, and tolerance specification. Orthographic, isometric, and oblique projections. Graphic design software (AutoCAD, SolidWorks), and file export formats. [Offered: F]", 
                    "subject": "BME", 
                    "title": "Comupter-Aided Design", 
                    "units": 0.25
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "121", 
                    "description": "The key skills necessary to develop software solutions to solve biomedical engineering problems. Topics include software development, software design, programming language syntax, object oriented programming, structured programming, arrays, matrices, pointers, and algorithm efficiency. The topics will be reinforced in the context of practical biomedical software systems such as physiological monitoring systems and clinical support systems. [Offered: F]", 
                    "subject": "BME", 
                    "title": "Digital Computation", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "161", 
                    "description": "Topics related to biomedical design will be covered: multidisciplinary system design, design process, problem definition, life-cycle design, design specification, function analysis, design evaluation and decision-making, introduction to mechanical design, prototyping, experimentation, safety and responsibility in engineering design, design for society and environment, and design documentation. [Offered: F]", 
                    "subject": "BME", 
                    "title": "Introduction to Biomedical Design", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "181", 
                    "description": "Introduction to the basic theory and principles of mechanics of static systems. Topics covered include: statics of particles, rigid bodies and force systems, equilibrium of rigid bodies, analysis of joints and frames, distributed forces, centroids and moments of inertia, and friction. Applications of mechanical principles to musculoskeletal systems will be presented. [Offered: F]", 
                    "subject": "BME", 
                    "title": "Physics I - Statics", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "111", 
                    "description": "Functions: trigonometric, exponential, log, inverse functions. Differential calculus: limits, continuity, derivatives, differentials, applications. Sequences and series: convergence, power series, Taylor expansions. Simple numerical methods. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Fundamental Engineering Math 1", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "112", 
                    "description": "Integration: Indefinite and definite integral; techniques of integration; improper integrals, numerical methods, applications. Vector differential calculus: Partial, total, and directional derivative; Gradient divergence and curl; Jacobian. Applications. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Fundamental Engineering Math 2", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "122", 
                    "description": "Topics of structured software design, data structures, abstract data types, recursive algorithms, algorithm and data structure analysis and design from both computational and memory perspectives, lists, stacks, queues, trees, graphs, sorting and searching, hashing, and problem-solving strategies. Embedded programming in health monitoring systems and healthcare management systems. [Offered: W]", 
                    "subject": "BME", 
                    "title": "Data Structures and Algorithms", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "162", 
                    "description": "Design of human-machine environments, designing for patient safety and reduce human error in decision making, analytical methods of determining user needs, information processing and human sensory processes and consideration of these elements in the design of systems with humans, and consideration of human physical capabilities in ergonomic design. Topics will be reinforced in the context of the design of prosthetics or rehabilitation devices. [Offered: W]", 
                    "subject": "BME", 
                    "title": "Human Factors in the Design of Biomedical and Health Systems", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "182", 
                    "description": "The science of motion is taught with initial focus on particles, and then progressing to planar rigid body systems. Concepts such as inertia, momentum, work, energy, Newton's laws, and contact dynamics are covered, with particular application to human motions (eg. walking, running, jumping, lifting, and throwing). [Offered: W]", 
                    "subject": "BME", 
                    "title": "Physics II - Dynamics", 
                    "units": 0.5
                }, 
                {
                    "catalog_number": "184", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "184L", 
                    "subject": "BME"
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "112", 
                    "description": "Integration: Indefinite and definite integral; techniques of integration; improper integrals, numerical methods, applications. Vector differential calculus: Partial, total, and directional derivative; Gradient divergence and curl; Jacobian. Applications. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Fundamental Engineering Math 2", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "114", 
                    "description": "Matrices and linear systems: determinants, eigenvalues and eigenvectors, LU decomposition, conditioning, numerical methods. First order ordinary differential equations: analytical techniques, applications, elementary numerical methods, convergence. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Numerical and Applied Calculus", 
                    "units": 0.25
                }
            ], 
            [
                {
                    "catalog_number": "213", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "261", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "281", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "281L", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "283", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "1", 
                    "subject": "CSE"
                }
            ], 
            [
                {
                    "catalog_number": "282", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "284", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "284L", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "286", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "292", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "292L", 
                    "subject": "BME"
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "211", 
                    "description": "Vector calculus: double and triple integrals, line and surface integrals, fundamental theorems, applications. Difference methods: root-finding, finite and divided differences, numerical differentiation, interpolation. Second order linear ordinary differential equations and systems. Applications in vibration.\r\n[Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Advanced Engineering Math 1", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "catalog_number": "351", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "361", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "381", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "391", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "391L", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "2", 
                    "subject": "CSE"
                }
            ], 
            [
                {
                    "catalog_number": "352", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "352L", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "354", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "362", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "364", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "384", 
                    "subject": "BME"
                }
            ], 
            [
                {
                    "catalog_number": "411", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "461", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "1", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "2", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "3", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "3", 
                    "subject": "CSE"
                }
            ], 
            [
                {
                    "catalog_number": "462", 
                    "subject": "BME"
                }, 
                {
                    "catalog_number": "4", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "5", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "6", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "4", 
                    "subject": "CSE"
                }
            ]
        ], 
        "curriculumTerms": [
            "1A", 
            "1B", 
            "2A", 
            "2B", 
            "3A", 
            "3B", 
            "4A", 
            "4B"
        ]
    }, 
    "facultyId": "", 
    "fees": null, 
    "gradPopulation": "319", 
    "images": [
        {
            "descriptor": "e5 building", 
            "link": "http://sub.tsavers.com/wp-content/uploads/2014/04/University-of-Waterloo-3.jpg", 
            "type": "misc"
        }
    ], 
    "importantDates": null, 
    "internship": null, 
    "location": null, 
    "metaData": {
        "dateCreated": "01-09-2014", 
        "dateModified": "01-09-2014", 
        "yearValid": 2015
    }, 
    "name": "Biomedical Engineering", 
    "numAccepted": "", 
    "numApplicants": "", 
    "rankings": [], 
    "rating": {
        "classmates": 0, 
        "difficulty": 0, 
        "guyRatio": null, 
        "professors": 0, 
        "ratingOverall": 0, 
        "schedule": 0, 
        "socialEnjoyment": 0, 
        "studyEnv": 0
    }, 
    "relatedPrograms": [
        "systemsdesignengineering"
    ], 
    "requirements": {
        "ap": "The Faculty of Engineering considers AP courses to be a good challenge and good preparation for our programs. You may find that you have covered some of the material in our first term courses but, in most cases, not enough for you to be exempted from the entire course without potentially running into academic difficulties later. The depth and level of problem-solving is very different in our Engineering programs than in AP courses and as a result, we don't grant first-year course exemptions for AP courses.", 
        "average": "<a href=\"https://uwaterloo.ca/find-out-more/admissions/individual-sTEion\">Individual sTEion</a> from the low 90s", 
        "country": "", 
        "general_requirements": "<ul><li>High school diploma or equivalent.<li>For some programs, a minimum grade in a required course is specified.</li><li>A minimum <b>final</b> overall average of 80% or higher is required on your best 6 Grade 12 U and/or M courses, including required courses.</li><ul><li>Higher averages are required for admission to programs where demand exceeds the number of places available.</li></ul><li>Grade 12 U or M courses must be completed through a school that is inspected by the Ontario Ministry of Education.</li><li><a href=\"https://uwaterloo.ca/find-out-more/admissions/repeated-courses\">Repeated courses</a> may be taken into consideration depending on the program.</li></ul>", 
        "individual_courses": [
            {
                "course_code": "4U", 
                "course_title": "Calculus and Vectors", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "English", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Physics", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Chemistry", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Advanced Functions", 
                "min_grade": "70"
            }
        ], 
        "international_program_requirements": "", 
        "list_courses": "", 
        "notes": "", 
        "other_documentation": [
            "If your first language is not English, you may need to meet our <a href=\" https://uwaterloo.ca/find-out-more/elr\">English language requirements.</a>", 
            "An <a href='https://uwaterloo.ca/find-out-more/aif'>Admission Information Form</a> must be filled out for most programs. Instructions will be included with the acknowledgment of your application.", 
            "<ul><li>Learn more about <a href=\" https://uwaterloo.ca/find-out-more/programs/mechatronics-engineering \">Mechatronics Engineering</a></li><li><a href=\"https://uwaterloo.ca/find-out-more/request\">Request a Faculty of Engineering brochure</a></li><li>Join us for a <a href=\"https://uwaterloo.ca/find-out-more/visit-waterloo/events \">campus tour</a></li></ul>"
        ], 
        "program": "Biomedical Engineering", 
        "program_notes": "", 
        "province": "Ontario", 
        "recommended_courses": "", 
        "system_of_study": "", 
        "transfer_credits": ""
    }, 
    "schoolId": "", 
    "shortName": "biomed", 
    "slug": "biomedicalengineering", 
    "streams": null, 
    "undergradPopulation": "976"
}