{
    "about": "The Management Engineering program provides undergraduate students with an engineering education needed to understand, design, implement and manage complex management systems upon which organizations depend. Management Engineering undergraduates obtain a degree which combines, as an integrated whole, technical and managerial knowledge along with opportunities to develop their problem-solving abilities, communication and interpersonal skills, project management experience, and teamwork and leadership skills.", 
    "applicationProcess": null, 
    "avgAdm": "90-93", 
    "contacts": [], 
    "dateEstablished": "01-07-1957", 
    "degree": "Bachelor's of Applied Science", 
    "degreeAbbrev": "BASc", 
    "degreeRequirements": {
        "about": "The Management Engineering program at Waterloo provides a solid foundation in management, engineering, science, and mathematics. On this foundation, the program also has a number of courses focused on one of the three theme areas:\nOperations Research and Supply Chain Management: Operations Research deals with quantitative models of complex operations and uses these models to support decision-making in any sector of industry or public services. Supply chain management is the process of planning, implementing and managing the flow of goods, services and related information from the point of origin to the point of consumption.\nInformation Technologies: The Information Technologies theme focuses on how technology is designed and managed to support effective decision-making. Topics deal with technical applications in software design and development, data mining and telecommunication as well as the organizational and social issues associated with the use of information technologies.\nManagement of Technology: The Management of Technology theme builds on the foundation of management topics in accounting, finance, economics, organizational behaviour and organizational design. Courses in this theme deal with operational and organizational issues related to managing innovation and technological change.\nThe capstone design project is intended to provide students with the opportunity to engage in a significant design experience based on the engineering and management knowledge and skills gained in previous courses and on co-operative work terms. The project will reinforce the concepts of team work and project management.", 
        "curriculum": [
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "102", 
                    "description": "Chemical principles with applications in engineering. Stoichiometric calculations, properties of gases, properties of liquids and solutions, gas phase chemical equilibrium, ionic equilibrium in aqueous solution, oxidation-reduction reactions, chemical kinetics. [Offered: F]", 
                    "subject": "CHE", 
                    "title": "Chemistry for Engineers", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "100", 
                    "description": "An introduction to the methods and principles of management engineering. Written, graphical, and oral forms of technical communication. Engineering graphics fundamentals of projection, computer-aided design, freehand sketching, and the interpretation of technical drawings. Introduction to quantitative methods of data analysis, planning, forecasting, decision modeling, and work flow analysis. Engineering design, including a management process design project with small groups. Aspects of the engineering profession including ethics, safety, and intellectual property. Professional development including résumé skills, interview skills, and preparation for co-op terms. [Offered: F]", 
                    "subject": "MSCI", 
                    "title": "Management Engineering Concepts", 
                    "units": 0.75
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "115", 
                    "description": "Linear equations, matrices and determinants. Introduction to vector spaces. Eigenvalues and diagonalization. Applications. Complex numbers. [Offered: F]", 
                    "subject": "MATH", 
                    "title": "Linear Algebra for Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "116", 
                    "description": "Functions: review of polynomials, exponential, logarithmic, trigonometric. Operations on functions, curve sketching. Trigonometric identities, inverse functions. Derivatives, rules of differentiation. Mean Value Theorem, Newton's Method. Indeterminate forms and L'Hopital's rule, applications. Integrals, approximations, Riemann definite integral, Fundamental Theorems. Applications of the integral. [Offered: F]", 
                    "subject": "MATH", 
                    "title": "Calculus 1 for Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "115", 
                    "description": "Brief review of kinematics. Particle dynamics, work, energy, conservation of energy. Conservation of linear momentum, collisions, rotational kinematics and dynamics, conservation of angular momentum. Equilibrium of rigid bodies. [Offered: F]", 
                    "subject": "PHYS", 
                    "title": "Mechanics", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "100B", 
                    "description": "General Seminar. [Offered: W]", 
                    "subject": "MSCI", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "123", 
                    "description": "Analysis of linear circuits: Voltage, current, resistance, capacitance, inductance, voltage source, current source, dependent sources, Ohm's Law, Kirchoff's Law, nodal analysis, mesh analysis, Thevinin/Norton equivalents, operational amplifier circuits, time response, sinusoidal steady-state response. Introduction to diodes with applications.", 
                    "subject": "GENE", 
                    "title": "Electrical Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "121", 
                    "description": "An introduction to computer programming using a high level programming language. Concepts and topics covered include the basic components of algorithms (primitive operations, variables, sequencing operations, conditionals/branching, repetition/loops, and subroutines/functions), problem decomposition, abstraction, testing and debugging, pseudo-code, file based input and output, use of a modern development environment including a symbolic debugger, good coding style, pointers/references, and basic data structures (arrays, records, objects). [Offered: W]", 
                    "subject": "MSCI", 
                    "title": "Introduction to Computer Programming", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "131", 
                    "description": "The course introduces fundamental concepts in two main areas: The first is work analysis and design where work methods design, motion and time study, and work sampling are covered. The second covers basic concepts in facilities planning such as process analysis, flow design, facility location and layout, and material handling systems. Students will apply these concepts in design activities in labs and projects. [Offered: W]", 
                    "subject": "MSCI", 
                    "title": "Work Design and Facilities Planning", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "261", 
                    "description": "Introductory Finance: time value of money, cash flow analysis. Investment evaluation methods: present worth, annual worth and internal rate of return. Depreciation models and asset replacement analysis. The impact of inflation, taxation, uncertainty and risk on investment decisions. [Offered: F,W,S]", 
                    "subject": "MSCI", 
                    "title": "Engineering Economics: Financial Management for Engineers", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "118", 
                    "description": "Methods of integration: by parts, trigonometric substitutions, partial fractions; engineering applications, approximation of integrals, improper integrals. Linear and separable first order differential equations, applications. Parametric curves and polar coordinates, arc length and area. Infinite sequences and series, convergence tests, power series and applications. Taylor polynomials and series, Taylor's Remainder Theorem, applications. [Offered: W,S]", 
                    "subject": "MATH", 
                    "title": "Calculus 2 for Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "125", 
                    "description": "Oscillations; simple harmonic motion. Wave motion, travelling and standing waves; transverse and longitudinal waves, including sound. Geometrical optics; reflection and refraction. Physical optics; interference and diffraction. Quantum physics; quantization of radiation; hydrogen atom. [Offered: W,S]", 
                    "subject": "PHYS", 
                    "title": "Physics for Engineers", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "200A", 
                    "description": "General seminar. [Offered: F]", 
                    "subject": "MSCI", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "240", 
                    "description": "Design and analysis of data structures and algorithms. Mathematical and conceptual analysis of algorithms for set operations, sorting, graphs, and priority queues. Comparison of algorithms on different data structures. Algorithmic and data structural solutions to common engineering problems in computer science. Mathematical analysis of space and time complexity as well as other forms of computational complexity in algorithms. [Offered: F]", 
                    "subject": "MSCI", 
                    "title": "Algorithms and Data Structures", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "262", 
                    "description": "This course provides students with an understanding of how costs are calculated and allocated within an organization. The focus is on developing an understanding of how all aspects of engineering impact the cost structure of an organization, and how these costs are analyzed and used in corporate planning and decision making processes. [Offered: F]", 
                    "subject": "MSCI", 
                    "title": "Managerial and Cost Accounting", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "271", 
                    "description": "This course introduces students to first and second order ordinary differential equations, vector calculus, and numerical methods for solution of systems of equations and ordinary differential equations. Applications in Management Engineering are emphasized. [Offered: F]", 
                    "subject": "MSCI", 
                    "title": "Advanced Calculus and Numerical Methods", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "235", 
                    "description": "The microstructure of crystalline and amorphous materials including metals, polymers and ceramics. Elastic and plastic deformation in metals, viscoelastic deformation of polymers and viscous deformation of ceramic glasses. Fracture of brittle and ductile solids. Phase equilibria, non-equilibrium behaviour, heat treatment of metals, diffusion, strengthening processes. [Offered: F]", 
                    "subject": "ME", 
                    "title": "Materials Science and Engineering", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "250", 
                    "description": "The engineering science of energy. The scope and limitations of thermodynamics. Macroscopic approach to heat, work, energy and the First Law. Properties and state of simple substances. Control-mass and control-volume energy analysis. The Second Law of Thermodynamics, principle of increase of entropy, limiting cycle efficiencies, criteria for equilibrium. [Offered: F, S]", 
                    "subject": "ME", 
                    "title": "Thermodynamics 1", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "200B", 
                    "description": "General seminar. [Offered: S]", 
                    "subject": "MSCI", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "211", 
                    "description": "Introduction to the concepts of learning, person perception, attitudes and motivation in an organization. Consideration of communication, roles, norms and decision making within a group. Discussion of power, control, leadership and management in light of the above concepts. [Offered: F, S]", 
                    "subject": "MSCI", 
                    "title": "Organizational Behaviour", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "252", 
                    "description": "This course introduces fundamental concepts in probability and statistics. It covers topics in probability, random variables, discrete and continuous probability distributions, confidence intervals, hypothesis testing, sampling, and introductory linear regression. Students are exposed to software packages that enable statistical analysis. [Offered: S]", 
                    "subject": "MSCI", 
                    "title": "Probability and Statistics for Engineers", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "263", 
                    "description": "This course introduces students to key concepts in microeconomics, with an emphasis on applications to managerial decision-making. Topics include: basic analysis of supply and demand, demand functions and the theory of consumer behaviour, production and costs, market equilibrium, competition between industry participants, and pricing strategies of firms under different market structures. [Offered: S]", 
                    "subject": "MSCI", 
                    "title": "Managerial Economics", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "331", 
                    "description": "This first course in optimization uses a quantitative approach to problem solving involving, mathematical modelling and formulations, solution methods, and output analysis. Students are introduced to a variety of practical problem formulations in Management and Engineering, a number of solution methods, including, but not limited to linear optimization, network models, project management, and decision analysis. Students are also involved in a group project, where they go through conceptual and operational model design, analytical solution, output analysis, and recommendation. [Offered: F, W, S]", 
                    "subject": "MSCI", 
                    "title": "Introduction to Optimization", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "346", 
                    "description": "Design and implementation of database solutions to common engineering and management problems. Multiple analytical methods for choosing optimal database designs. Topics include relational database design, data definition, entity modeling, structured query language and emerging types of database systems. [Offered: S]", 
                    "subject": "MSCI", 
                    "title": "Database Systems", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "219", 
                    "description": "Concept of equilibrium, force analysis of structures and structural components, equilibrium of deformable bodies, stress and strain concepts, stress-strain relationships, stress analysis of prismatic members in axial, shearing, torsional and flexural deformations, shear force and bending moment diagrams. [Offered: F, W, S]", 
                    "subject": "ME", 
                    "title": "Mechanics of Deformable Solids 1", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "300A", 
                    "description": "General Seminar. [Offered: W]", 
                    "subject": "MSCI", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "311", 
                    "description": "The focus of this course is on the procedures and variables involved in the design and redesign of organizations. Issues such as departmentation, differentiation, integration, internal politics, innovation, authority and control are discussed in the context of the underlying technology of the organization. Emphasis will be placed on how one designs both the technical and the organizational systems to ensure their compatibility, noting the effects that one has on the other. [Offered: F, W]", 
                    "subject": "MSCI", 
                    "title": "Organizational Design and Technology", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "334", 
                    "description": "This course exposes students to production planning and inventory control approaches in industrial and service systems. Production planning topics cover capacity and resources planning, production scheduling, manufacturing resource planning, Just-In-Time and lean manufacturing. Inventory control topics cover lot sizing policies, deterministic and stochastic inventory policies. The course involves a design project of a production and/or inventory system. [Offered: W]", 
                    "subject": "MSCI", 
                    "title": "Operations Planning and Inventory Control", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "431", 
                    "description": "Introduction to Operations Research models and methods for problems with random, stochastic and probabilistic components. Topics include birth and death processes, branching processes, waiting line models, and Markov decision processes. Applications include, the design, modelling, and analysis of service and manufacturing systems, with emphasis on important functions such as queueing, inventory, reliability, equipment replacement, and maintenance. [Offered: W]", 
                    "subject": "MSCI", 
                    "title": "Stochastic Models and Methods", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "444", 
                    "description": "The course is intended to provide students with the knowledge of the theory and practice of information systems development stages, techniques and methodologies. Course topics may include: requirements analysis, structured and object-oriented design techniques and system implementation strategies. [Offered: W]", 
                    "subject": "MSCI", 
                    "title": "Information Systems Analysis and Design", 
                    "units": 0.5
                }, 
                {
                    "catalog_number": "1", 
                    "subject": "TE"
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "1", 
                    "description": "A work-term report presenting in detail a technical project, activity, or analysis engaged by the student during the work term.", 
                    "subject": "WKRPT", 
                    "title": "Work-term Report", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "300B", 
                    "description": "General Seminar. [Offered: F]", 
                    "subject": "MSCI", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "332", 
                    "description": "This course builds on the material presented in MSCI 331, and explores more advanced optimization techniques and applications. Methods, such as integer optimization, dynamic programming, and heuristics are introduced and used to design solution alternatives for applications from Management Engineering. This may include network and process design in logistics, transportation, telecommunications, and healthcare. [Offered: F]", 
                    "subject": "MSCI", 
                    "title": "Deterministic Optimization Models and Methods", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "333", 
                    "description": "This course introduces the use of discrete event simulation as an approach for understanding and analyzing complex management systems. Topics include an introduction to simulation modeling, general purpose and special purpose simulation languages, designing valid and credible simulation models, input data analysis, output analysis and experimental design. [Offered: F]", 
                    "subject": "MSCI", 
                    "title": "Simulation Analysis and Design", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "342", 
                    "description": "The purpose of this course is to study methods necessary to cost-effectively address difficult problems arising in the development, management and evolution of software systems.Topics include requirements engineering and analysis; different methods for software design; techniques for building dependable software systems; verification and validation of systems cost estimation, resource estimation and project management; and maintenance issues. [Offered: F]", 
                    "subject": "MSCI", 
                    "title": "Principles of Software Engineering", 
                    "units": 0.5
                }, 
                {
                    "catalog_number": "2", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "3", 
                    "subject": "TE"
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "2", 
                    "description": "A work-term report presenting in detail a technical project, activity, or analysis engaged by the student during the work term.", 
                    "subject": "WKRPT", 
                    "title": "Work-term Report", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "400A", 
                    "description": "General Seminar. [Offered: S]", 
                    "subject": "MSCI", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "401", 
                    "description": "This is the first course of a two course sequence to provide students with an opportunity to engage in a significant design experience based on the engineering knowledge and skills gained in previous courses and on cooperative work terms. The instructor will review and extend concepts of project management studied in earlier courses, and students will apply these project management skills. Teams of students will formulate a design problem and submit a preliminary project proposal, make oral presentations for preliminary and interim design reviews, and submit a written interim report describing the proposed design solution. [Offered S]", 
                    "subject": "MSCI", 
                    "title": "Management Engineering Design Project 1", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "434", 
                    "description": "This course focuses on the efficient use of material, information, physical and human capital resources in supply-demand networks consisting of suppliers, manufacturers, distributors, retailers and customers. It emphasizes analytic tools used to design, implement and sustain competitive supply chain systems. The material will highlight application of supply chain practices in industry and supply chain implementation challenges. Issues associated with international or global supply chains will be discussed.\r\n[Offered: S]", 
                    "subject": "MSCI", 
                    "title": "Supply Chain Management", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "445", 
                    "description": "An introduction to design, use and analysis of computer networks and telecommunication systems with a focus on technological issues arising in the rapidly developing field of telecommunications and information technology. The emphasis is on what engineers need to know about telecommunication to make sound business decisions, and utilize networks in software applications. The material will be taught using a top-down approach. Topics include: systems, security, applications, evolution of the field, performance, and technology.\r\n[Offered: S]", 
                    "subject": "MSCI", 
                    "title": "Telecommunication Systems: from protocols to applications", 
                    "units": 0.5
                }, 
                {
                    "catalog_number": "4", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "5", 
                    "subject": "TE"
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "3", 
                    "description": "A work-term report presenting in detail a technical project, activity, or analysis engaged by the student during the work term.", 
                    "subject": "WKRPT", 
                    "title": "Work-term Report", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "400B", 
                    "description": "General Seminar. [Offered: W]", 
                    "subject": "MSCI", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "402", 
                    "description": "This is the second course of a two course sequence to provide students with an opportunity to engage in a significant design experience based on the engineering knowledge and skills gained in previous courses and on cooperative work terms. Each student team is required to complete the detailed design for the project defined in MSCI 401, submit a final written report, and make an oral presentation describing their design solution. [Offered: W]", 
                    "subject": "MSCI", 
                    "title": "Management Engineering Design Project 2", 
                    "units": 0.5
                }, 
                {
                    "catalog_number": "6", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "7", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "8", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "9", 
                    "subject": "TE"
                }
            ]
        ], 
        "curriculumTerms": [
            "1A", 
            "1B", 
            "2A", 
            "2B", 
            "3A", 
            "3B", 
            "4A", 
            "4B"
        ]
    }, 
    "facultyId": "", 
    "fees": null, 
    "gradPopulation": "186", 
    "images": [
        {
            "descriptor": "e5 building", 
            "link": "http://sub.tsavers.com/wp-content/uploads/2014/04/University-of-Waterloo-3.jpg", 
            "type": "misc"
        }
    ], 
    "importantDates": null, 
    "internship": null, 
    "location": null, 
    "metaData": {
        "dateCreated": "01-09-2014", 
        "dateModified": "01-09-2014", 
        "yearValid": 2015
    }, 
    "name": "Management Engineering", 
    "numAccepted": "", 
    "numApplicants": "", 
    "rankings": [], 
    "rating": {
        "classmates": 0, 
        "difficulty": 0, 
        "guyRatio": 61.8, 
        "professors": 0, 
        "ratingOverall": 0, 
        "schedule": 0, 
        "socialEnjoyment": 0, 
        "studyEnv": 0
    }, 
    "relatedPrograms": [], 
    "requirements": {
        "ap": "The Faculty of Engineering considers AP courses to be a good challenge and good preparation for our programs. You may find that you have covered some of the material in our first term courses but, in most cases, not enough for you to be exempted from the entire course without potentially running into academic difficulties later. The depth and level of problem-solving is very different in our Engineering programs than in AP courses and as a result, we don't grant first-year course exemptions for AP courses.", 
        "average": "<a href=\"https://uwaterloo.ca/find-out-more/admissions/individual-selection\">Individual selection</a> from the low 90s", 
        "country": "", 
        "general_requirements": "<ul><li>High school diploma or equivalent.<li>For some programs, a minimum grade in a required course is specified.</li><li>A minimum <b>final</b> overall average of 80% or higher is required on your best 6 Grade 12 U and/or M courses, including required courses.</li><ul><li>Higher averages are required for admission to programs where demand exceeds the number of places available.</li></ul><li>Grade 12 U or M courses must be completed through a school that is inspected by the Ontario Ministry of Education.</li><li><a href=\"https://uwaterloo.ca/find-out-more/admissions/repeated-courses\">Repeated courses</a> may be taken into consideration depending on the program.</li></ul>", 
        "individual_courses": [
            {
                "course_code": "4U", 
                "course_title": "Calculus and Vectors", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "English", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Physics", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Chemistry", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Advanced Functions", 
                "min_grade": "70"
            }
        ], 
        "international_program_requirements": "", 
        "list_courses": "", 
        "notes": "", 
        "other_documentation": [
            "If your first language is not English, you may need to meet our <a href=\" https://uwaterloo.ca/find-out-more/elr\">English language requirements.</a>", 
            "An <a href='https://uwaterloo.ca/find-out-more/aif'>Admission Information Form</a> must be filled out for most programs. Instructions will be included with the acknowledgment of your application.", 
            "<ul><li>Learn more about <a href=\" https://uwaterloo.ca/find-out-more/programs/mechatronics-engineering \">Mechatronics Engineering</a></li><li><a href=\"https://uwaterloo.ca/find-out-more/request\">Request a Faculty of Engineering brochure</a></li><li>Join us for a <a href=\"https://uwaterloo.ca/find-out-more/visit-waterloo/events \">campus tour</a></li></ul>"
        ], 
        "program": "Management Engineering", 
        "program_notes": "", 
        "province": "Ontario", 
        "recommended_courses": "", 
        "system_of_study": "", 
        "transfer_credits": ""
    }, 
    "schoolId": "", 
    "shortName": "manag", 
    "slug": "managementengineering", 
    "streams": null, 
    "undergradPopulation": "297"
}