{
    "about": "Effective solutions to problems involving both society and technology must be based on a broad systems point-of-view. Not only must the overall technical factors of these problems be carefully considered, but the economic, social, human and political parameters must be given equally careful attention. When large scale engineering problems are under study, few people can be knowledgeable of the complete span of factors and parameters that must be considered. For these cases, solutions must be arrived at by interdisciplinary teams where each member contributes his or her own special expertise. In order to work effectively on this team, each member needs to be aware of the fundamental systems and design aspects of the problem. The rapid growth and complexity of industry have, indeed, created unusual problems; however, underlying the complexities of modern civilization and technology are similarities that make it possible to approach problems in many diverse fields with essentially the same concepts, theories and techniques. Systems theory has emerged as a scientific discipline for quantitative analysis, design and control of large classes of problems in engineering and social sciences.\nThe undergraduate program in Systems Design Engineering at Waterloo is a study of those basic skills required for system analysis, simulation, optimization and design. Numerous examples may be cited where these systems design fundamentals may be applied: transportation, engineering design, computer applications, water resources engineering, production, planning and scheduling, environmental pollution, education. Of course the importance of specialized expertise in these areas should not be minimized, but these skills usually work most effectively toward problem solutions when operating within an overall systems context.", 
    "applicationProcess": null, 
    "avgAdm": "90-93", 
    "contacts": [], 
    "dateEstablished": "01-07-1957", 
    "degree": "Bachelor's of Applied Science", 
    "degreeAbbrev": "BASc", 
    "degreeRequirements": {
        "about": "The Undergraduate program in Systems Design Engineering encompasses the study of the basic skills required for systems analysis, simulation, optimization and design. In particular the first three years of the program are intended to provide each student with a broad background and capability in the areas of:\nengineering design\napplied mathematics\nengineering sciences and systems theory\nsocio-economic systems\nhuman systems engineering\ncomputer systems and applications\nThroughout these three years the student's ability to grasp real engineering problems is enhanced by courses in Systems Design methodology followed by a series of challenging problem-solving experiences in the Systems Design Workshops. It is here that a focus is given to the whole curriculum and the student learns to apply the lecture material, to develop skills in solving problems that cut across the traditional disciplines, and to develop design, planning and organizational abilities.\nThe final year of the program is comprised mostly of elective courses, allowing the student to emphasize one or more areas of study. This provides the required background for a future year of advanced study to the MASc degree, or for a rewarding career in industry or government with the Bachelor's degree (BASc).", 
        "curriculum": [
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "101", 
                    "description": "This course introduces first year students to Systems Design Engineering. The fundamental emphases of the course are on the Engineering profession and on communication skills: graphical, written, and oral. Engineering practice will be discussed, including Engineering professional development, Engineering ethics, résumé skills, interview skills, the co-op system, and preparations for the upcoming co-op term. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Introduction to Systems Design Engineering", 
                    "units": 0.25
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "101L", 
                    "description": "Laboratory experiments for students taking SYDE 101. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Graphics Laboratory", 
                    "units": 0.25
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "111", 
                    "description": "Functions: trigonometric, exponential, log, inverse functions. Differential calculus: limits, continuity, derivatives, differentials, applications. Sequences and series: convergence, power series, Taylor expansions. Simple numerical methods. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Fundamental Engineering Math 1", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "113", 
                    "description": "Geometry and algebra: root-finding, vectors, coordinate systems, lines and planes, conic sections, complex numbers. Introduction to numerical computation. Floating point arithmetic, accuracy and sources of error. Matrix algebra, inverses. Analytical and numerical techniques for systems of linear equations. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Matrices and Linear Systems", 
                    "units": 0.25
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "121", 
                    "description": "Computer systems, problem solving, data and programs, structured programming, arrays, matrices and pointers, correct and efficient algorithms, data structures. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Digital Computation", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "161", 
                    "description": "Multidisciplinary system design, the design process, problem definition, life-cycle design, design specification, concept/design generation and evaluation, design for manufacturing and assembly, system modelling and analysis, introduction to mechanical design, prototyping, safety and responsibility in engineering design, design documentation. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Introduction to Design", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "181", 
                    "description": "Basic concepts of mechanics, vectors. Statics of particles. Rigid bodies and force systems, equilibrium of rigid bodies. Analysis of trusses and frames. Distributed forces, centroids and moments of inertia. Friction. Virtual work. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Physics 1 (Statics)", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "102", 
                    "description": "Systems Design first year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work and engineering practice will be discussed. Non-credit course. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "112", 
                    "description": "Integration: Indefinite and definite integral; techniques of integration; improper integrals, numerical methods, applications. Vector differential calculus: Partial, total, and directional derivative; Gradient divergence and curl; Jacobian. Applications. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Fundamental Engineering Math 2", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "114", 
                    "description": "Matrices and linear systems: determinants, eigenvalues and eigenvectors, LU decomposition, conditioning, numerical methods. First order ordinary differential equations: analytical techniques, applications, elementary numerical methods, convergence. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Numerical and Applied Calculus", 
                    "units": 0.25
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "162", 
                    "description": "Design of human-machine environments, design to reduce human error. Analytical methods of determining user needs in systems with humans. Information processing and human sensory processes and consideration of these elements in the design of systems with humans. Human physical capabilities and consideration of these in ergonomic design. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Human Factors in Design", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "182", 
                    "description": "Kinematics of particles, rectilinear and curvilinear motion. Kinetics of particles, application to space mechanics. Energy and momentum methods. Systems of particles. Kinematics and kinetics of rigid bodies; planar motion. Vibrations. [Offered: S, W]", 
                    "subject": "SYDE", 
                    "title": "Physics 2 (Dynamics)", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "192", 
                    "description": "Digital technology, combinatorial logic, binary arithmetic, synchronous sequential circuits, design methodology, algorithmic state machines, microcomputer interfacing. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Digital Systems", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "192L", 
                    "description": "Laboratory experiments for students taking SYDE 192. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Digital Systems Laboratory", 
                    "units": 0.25
                }, 
                {
                    "catalog_number": "1", 
                    "subject": "CSE"
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "201", 
                    "description": "Systems Design second-year students will meet a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work and engineering practice will be discussed. Non-credit course. [Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "211", 
                    "description": "Vector calculus: double and triple integrals, line and surface integrals, fundamental theorems, applications. Difference methods: root-finding, finite and divided differences, numerical differentiation, interpolation. Second order linear ordinary differential equations and systems. Applications in vibration.\r\n[Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Advanced Engineering Math 1", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "223", 
                    "description": "Algorithms and Data Structures emphasizes the following topics: structured software design, data structures, abstract data types, recursive algorithms, algorithm analysis and design, sorting and searching, hashing, problem-solving strategies and NP-completeness. [Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Data Structures and Algorithms", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "261", 
                    "description": "This non-technical course will help students understand how others think about technology and then use this knowledge to make better choices when designing, specifying, choosing and implementing technology. The course includes topics such as: meanings of design and their implications; designed in/designed out analysis; reductionism and integration in design; the limits of objective thinking; alternate ways to define function; content and context; \"we/me/them/it\" analysis; redefining what constitutes acceptable technology; learning from the margins; reading design and understanding system boundaries as being defined by what we do rather than what we say. [Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Design, Systems, and Society", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "283", 
                    "description": "Introduction to the fundamental laws of electricity, magnetism and optics; electric fields, voltage, resistance, current, properties of conductors and semiconductors, capacitance, properties of dielectrics, magnetic fields, Faraday's Law and inductance, properties of magnetic materials; electromagnetic waves and the nature of light, geometrical optics: reflection and refraction, physical optics: interference and diffraction. [Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Physics 3 (Electricity, Magnetism and Optics)", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "285", 
                    "description": "The course will present how the fundamentals of chemistry are applied to materials science and engineering. Concepts such as chemical bonding, crystal structure, phase diagram, redox reaction, and electrochemistry will be introduced in the context of materials science. Properties, processing and structure of metals, semiconductors, polymers, ceramic, nanomaterials and biomaterials will be presented. [Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Materials Chemistry", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "202", 
                    "description": "Systems Design second-year students will meet a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work and engineering practice will be discussed. Non-credit course. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "212", 
                    "description": "Elementary probability theory. Random variables and distributions. Binomial, Poisson, and normal distributions. Elementary sampling. Statistical estimation. Tests of hypotheses and significance. Regression. Goodness-of-fit tests. Analysis of experimental measurements. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Probability and Statistics", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "252", 
                    "description": "Models and analysis of linear systems. Discrete time systems, continuous time systems; difference and differential equations; impulse and frequency response. Complex frequency, functions of complex variables, transform domain techniques: Z transforms; Fourier analysis, Laplace transform. Transfer functions and frequency response, frequency domain analysis of linear systems; sampling theory, stability, and linear filters. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Linear Systems and Signals", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "262", 
                    "description": "This course examines a variety of economic factors in Engineering and how they impact design. Topics include business plans, price and output decisions, choosing among alternative inputs, production processes, evaluating alternative investments, equipment service life and depreciation, new products. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Engineering Economics of Design", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "286", 
                    "description": "Introduction to mechanical response of materials and stress-strain relationship. Behaviour of prismatic members in tension, compression, shear, bending and torsion. Shear-force and bending-moment diagrams. Introduction to instability. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Mechanics of Deformable Solids", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "292", 
                    "description": "Active and passive circuit elements, Kirchhoff's laws, mesh and nodal circuit analysis, principle of superposition; step response of first and second order networks; sinusoidal steady state analysis using complex impedance phasors; input-output relationships, transfer functions and frequency response of linear systems; operational amplifiers, operational amplifier circuits using negative or positive feedback; diodes, operational amplifier circuits using diodes; analog signal detection, conditioning and conversion systems; transducers, difference and instrumentation amplifiers, active filters, A/D and D/A conversion. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Circuits, Instrumentation, and Measurements", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "292L", 
                    "description": "Laboratory experiments for students taking SYDE 292. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Circuits, Instrumentation, and Measurements Laboratory", 
                    "units": 0.25
                }, 
                {
                    "catalog_number": "1", 
                    "subject": "CSE"
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "1", 
                    "description": "A work-term report presenting in detail a technical project, activity, or analysis engaged by the student during the work term.", 
                    "subject": "WKRPT", 
                    "title": "Work-term Report", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "301", 
                    "description": "Systems Design third year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work and engineering practice will be discussed. Non-credit course. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "311", 
                    "description": "Series solutions of ordinary differential equations: Bessel functions, orthogonal functions, Fourier expansions and integral, Legendre polynomials, Sturm-Liouville systems. Partial differential equations: parabolic, hyperbolic and elliptic equations, numerical methods. Numerical integration: Gaussian quadrature, Runge-Kutta methods. Nonlinear systems: qualitative analysis, phase plane, Newton-Raphson method. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Advanced Engineering Math 2", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "351", 
                    "description": "Introduction to systems modelling and analysis. Graph theoretic models and formulation of system equations. State space formulation and solution. Time and frequency domain solutions. Application to engineering systems. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Systems Models 1", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "361", 
                    "description": "The methodology of design: defects, needs and the problem definition; criteria and generation of alternative solutions; feasibility analysis; optimization; selection, implementation and solution. The lecture material is supplemented by a term long design project done in small groups. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Engineering Design", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "381", 
                    "description": "An introductory course in engineering thermodynamics structured for students in Systems Design. Classical thermodynamics is presented as the systematic study of energy; its use, degradation, and waste. Introduction to heat transfer by conduction, convection, and radiation. Applications focus on problems of energy and environment. The concepts of statistical thermodynamics are introduced. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Thermodynamics", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "383", 
                    "description": "Fundamental concepts in systems involving fluid flow. Basic treatment of statics, kinematics and dynamics of fluids. Conservation of mass, momentum and energy for a control volume. Dimensional analysis and similarity. Flow in pipes and channels. Brief introduction to boundary layers, lift and drag, ideal and compressible flow. [Offered: S]", 
                    "subject": "SYDE", 
                    "title": "Fluid Mechanics", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "2", 
                    "description": "A work-term report presenting in detail a technical project, activity, or analysis engaged by the student during the work term.", 
                    "subject": "WKRPT", 
                    "title": "Work-term Report", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "302", 
                    "description": "Systems Design third year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work and engineering practice will be discussed. Non-credit course. [Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "312", 
                    "description": "Vector spaces, linear independence, linear maps and matrix representations. Inner product spaces and orthogonality. Gramm-Schmidt algorithm and orthogonal projection. Interpolation and curve-fitting. Eigenvalues and eigenvectors, diagonalization, singular value decomposition. Applications and numerical methods. [Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Applied Linear Algebra", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "352", 
                    "description": "Classical and state space representations of control systems. Stability, controllability, observability and sensitivity. Routh-Hurwitz and root-locus methods. Frequency domain behaviour, Bode plots, Nyquist stability criteria. Pole placement, PID, phase-lead and phase-lag controllers.(labs alt. weeks) [Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Introduction to Control Systems", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "352L", 
                    "description": "Laboratory experiments for students taking SYDE 352. [Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Control Systems Laboratory", 
                    "units": 0.25
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "362", 
                    "description": "Engineering design project course where students work in small groups applying the principles of engineering problem solving, systems analysis, simulation, optimization and design to a problem of their own choosing. Students have individual project supervisors as well as an overall coordinator who provides the framework for the term projects. [Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Systems Design Workshop 1", 
                    "units": 0.5
                }, 
                {
                    "catalog_number": "2", 
                    "subject": "CSE"
                }, 
                {
                    "catalog_number": "1", 
                    "subject": "TE"
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "401", 
                    "description": "Systems Design fourth-year students will meet with a faculty member designated as their class professor. Conceptual difficulties, the interrelation of course work and engineering practice will be discussed. Non-credit course. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "411", 
                    "description": "Root-finding methods. Linear programming, simplex and interior-point methods. Local and global optimization methods. Constrained optimization. Multiobjective and multidisciplinary design optimization.[Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Optimization and Numerical Methods", 
                    "units": 0.5
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "461", 
                    "description": "The first half of a two term engineering design project continuing the systems design workshop sequence. An interim progress report is presented at the end of the first term. [Offered: F]", 
                    "subject": "SYDE", 
                    "title": "Systems Design Workshop 2", 
                    "units": 0.5
                }, 
                {
                    "catalog_number": "3/2", 
                    "subject": "CSE/TE"
                }, 
                {
                    "catalog_number": "2", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "3", 
                    "subject": "TE"
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "3", 
                    "description": "A work-term report presenting in detail a technical project, activity, or analysis engaged by the student during the work term.", 
                    "subject": "WKRPT", 
                    "title": "Work-term Report", 
                    "units": 0.5
                }
            ], 
            [
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "402", 
                    "description": "Systems Design fourth-year students will meet with a faculty member designated as their class professor. Conceptual difficulties, the interrelation of course work and engineering practice will be discussed. Non-credit course. [Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Seminar", 
                    "units": 0
                }, 
                {
                    "academic_level": "undergraduate", 
                    "catalog_number": "462", 
                    "description": "The concluding half of the fourth year Systems Design Workshop. [Offered: W]", 
                    "subject": "SYDE", 
                    "title": "Systems Design Workshop 3", 
                    "units": 0.5
                }, 
                {
                    "catalog_number": "3", 
                    "subject": "CSE"
                }, 
                {
                    "catalog_number": "4", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "5", 
                    "subject": "TE"
                }, 
                {
                    "catalog_number": "6", 
                    "subject": "TE"
                }
            ]
        ], 
        "curriculumTerms": [
            "1A", 
            "1B", 
            "2A", 
            "2B", 
            "3A", 
            "3B", 
            "4A", 
            "4B"
        ]
    }, 
    "facultyId": "", 
    "fees": null, 
    "gradPopulation": "136", 
    "images": [
        {
            "descriptor": "e5 building", 
            "link": "http://sub.tsavers.com/wp-content/uploads/2014/04/University-of-Waterloo-3.jpg", 
            "type": "misc"
        }
    ], 
    "importantDates": null, 
    "internship": null, 
    "location": null, 
    "metaData": {
        "dateCreated": "01-09-2014", 
        "dateModified": "01-09-2014", 
        "yearValid": 2015
    }, 
    "name": "System Design Engineering", 
    "numAccepted": "", 
    "numApplicants": "", 
    "rankings": [], 
    "rating": {
        "classmates": 0, 
        "difficulty": 0, 
        "guyRatio": 66, 
        "professors": 0, 
        "ratingOverall": 0, 
        "schedule": 0, 
        "socialEnjoyment": 0, 
        "studyEnv": 0
    }, 
    "relatedPrograms": [
        "biomedicalengineering", 
        "softwareengineering"
    ], 
    "requirements": {
        "ap": "The Faculty of Engineering considers AP courses to be a good challenge and good preparation for our programs. You may find that you have covered some of the material in our first term courses but, in most cases, not enough for you to be exempted from the entire course without potentially running into academic difficulties later. The depth and level of problem-solving is very different in our Engineering programs than in AP courses and as a result, we don't grant first-year course exemptions for AP courses.", 
        "average": "<a href=\"https://uwaterloo.ca/find-out-more/admissions/individual-selection\">Individual selection</a> from the low 90s", 
        "country": "", 
        "general_requirements": "<ul><li>High school diploma or equivalent.<li>For some programs, a minimum grade in a required course is specified.</li><li>A minimum <b>final</b> overall average of 80% or higher is required on your best 6 Grade 12 U and/or M courses, including required courses.</li><ul><li>Higher averages are required for admission to programs where demand exceeds the number of places available.</li></ul><li>Grade 12 U or M courses must be completed through a school that is inspected by the Ontario Ministry of Education.</li><li><a href=\"https://uwaterloo.ca/find-out-more/admissions/repeated-courses\">Repeated courses</a> may be taken into consideration depending on the program.</li></ul>", 
        "individual_courses": [
            {
                "course_code": "4U", 
                "course_title": "Calculus and Vectors", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "English", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Physics", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Chemistry", 
                "min_grade": "70"
            }, 
            {
                "course_code": "4U", 
                "course_title": "Advanced Functions", 
                "min_grade": "70"
            }
        ], 
        "international_program_requirements": "", 
        "list_courses": "", 
        "notes": "", 
        "other_documentation": [
            "If your first language is not English, you may need to meet our <a href=\" https://uwaterloo.ca/find-out-more/elr\">English language requirements.</a>", 
            "An <a href='https://uwaterloo.ca/find-out-more/aif'>Admission Information Form</a> must be filled out for most programs. Instructions will be included with the acknowledgment of your application.", 
            "<ul><li>Learn more about <a href=\" https://uwaterloo.ca/find-out-more/programs/mechatronics-engineering \">Mechatronics Engineering</a></li><li><a href=\"https://uwaterloo.ca/find-out-more/request\">Request a Faculty of Engineering brochure</a></li><li>Join us for a <a href=\"https://uwaterloo.ca/find-out-more/visit-waterloo/events \">campus tour</a></li></ul>"
        ], 
        "program": "System Design Engineering", 
        "program_notes": "", 
        "province": "Ontario", 
        "recommended_courses": "", 
        "system_of_study": "", 
        "transfer_credits": ""
    }, 
    "schoolId": "", 
    "shortName": "syde", 
    "slug": "systemsdesignengineering", 
    "streams": null, 
    "undergradPopulation": "417"
}